{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "c5373b08",
   "metadata": {
    "slideshow": {
     "slide_type": "slide"
    }
   },
   "source": [
    "# Задание 23. Не_рекурсия\n",
    "\n",
    "*Леонтьев Михаил, 2024*"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "8a9574ad",
   "metadata": {
    "slideshow": {
     "slide_type": "slide"
    }
   },
   "source": [
    "## Примеры"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "d5370823",
   "metadata": {
    "slideshow": {
     "slide_type": "subslide"
    }
   },
   "source": [
    "### Пример 1\n",
    "\n",
    "Исполнитель Тренер преобразует число на экране. У исполнителя есть две команды, которым присвоены номера:\n",
    "\n",
    "1. Прибавить 1\n",
    "2. Прибавить 2\n",
    "\n",
    "Первая команда увеличивает число на экране на 1, вторая увеличивает его на 2. Программа для исполнителя Тренер – это последовательность команд.\n",
    "Сколько существует программ, для которых при исходном числе 1 результатом является число 12?"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "98dc6692",
   "metadata": {},
   "source": [
    "Заметим, что можно свести задачу к рекурсии. А именно: сколько существует программ для 1->12? Это общее количество программ для 1->11 и 1->10. Из этих двух программ добавлением одной команды (2 и 1 соответственно) получается программа для 1->12.\n",
    "\n",
    "А теперь сколько существует программ для 1->1? Очевидно, что одна - ничего не делать. Таким образом, получаем:\n",
    "```\n",
    "F(n) = 1, при n = 1\n",
    "F(n) = F(n - 1) + F(n - 2), при n > 1\n",
    "```\n",
    "\n",
    "Нужно получить F(12). Такие задачи мы уже умеем решать"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "807ef7c0",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "144\n"
     ]
    }
   ],
   "source": [
    "F = [0] * 13\n",
    "\n",
    "for i in range(1, 13):\n",
    "    if i == 1:\n",
    "        F[i] = 1\n",
    "    else:\n",
    "        F[i] = F[i - 1] + F[i - 2]\n",
    "\n",
    "print(F[12])"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "6767a25c",
   "metadata": {
    "slideshow": {
     "slide_type": "subslide"
    }
   },
   "source": [
    "### Пример 2\n",
    "\n",
    "Исполнитель РазДва преобразует число на экране.\n",
    "У исполнителя есть две команды, которым присвоены номера:\n",
    "\n",
    "1. Прибавить 1\n",
    "2. Умножить на 2\n",
    "\n",
    "Первая команда увеличивает число на экране на 1, вторая умножает его на 2. Программа для исполнителя РазДва — это последовательность команд.\n",
    "\n",
    "Сколько существует программ, для которых при исходном числе 3 результатом является число 37 и при этом траектория вычислений содержит число 18?"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "2fda18c7",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "28\n"
     ]
    }
   ],
   "source": [
    "F = [0] * 38\n",
    "\n",
    "# сначала вычислим все значения до 18 включительно\n",
    "for i in range(3, 19):\n",
    "    if i == 3:\n",
    "        F[i] = 1\n",
    "    else:\n",
    "        F[i] = F[i - 1]\n",
    "        \n",
    "        # если i четное, то оно могло получиться с помощью команды 2\n",
    "        if i % 2 == 0:\n",
    "            F[i] += F[i // 2]\n",
    "\n",
    "# теперь обнулим все значения кроме 18\n",
    "for i in range(3, 18):\n",
    "    F[i] = 0\n",
    "\n",
    "# теперь, когда мы вычислим остальные значения, то будем учитывать\n",
    "# только программы через 18 (остальные были обнулены) \n",
    "for i in range(19, 38):\n",
    "    F[i] = F[i - 1]\n",
    "        \n",
    "    # если i четное, то оно могло получиться с помощью команды 2\n",
    "    if i % 2 == 0:\n",
    "        F[i] += F[i // 2]\n",
    "\n",
    "print(F[37])"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "af949205",
   "metadata": {
    "slideshow": {
     "slide_type": "subslide"
    }
   },
   "source": [
    "### Пример 3\n",
    "\n",
    "Исполнитель РазДваТри преобразует число на экране. У исполнителя есть три команды, которым присвоены номера:\n",
    "\n",
    "1. Прибавить 1\n",
    "2. Умножить на 2\n",
    "3. Прибавить 3\n",
    "\n",
    "Первая команда увеличивает число на экране на 1, вторая умножает его на 2, третья увеличивает на 3. \n",
    "Программа для исполнителя РазДваТри — это последовательность команд.\n",
    "\n",
    "Сколько существует программ, которые преобразуют исходное число 2 в число 14 и при этом траектория вычислений не содержит чисел 5 и 10? "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "7b91736a",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "26\n"
     ]
    }
   ],
   "source": [
    "F = [0] * 15\n",
    "\n",
    "# сначала вычислим все значения до 18 включительно\n",
    "for i in range(2, 15):\n",
    "    if i == 2:\n",
    "        F[i] = 1\n",
    "    elif i == 5 or i == 10:\n",
    "        # обнуляем программы, которые проходят через 5 или 10\n",
    "        F[i] = 0\n",
    "    else:\n",
    "        F[i] = F[i - 1] + F[i - 3]\n",
    "        \n",
    "        # если i четное, то оно могло получиться с помощью команды 2\n",
    "        if i % 2 == 0:\n",
    "            F[i] += F[i // 2]\n",
    "\n",
    "print(F[14])"
   ]
  }
 ],
 "metadata": {
  "celltoolbar": "Слайд-шоу",
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.5"
  },
  "rise": {
   "enable_chalkboard": true,
   "scroll": true
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
